In [2]:
import mysql.connector
import pandas as pd

In [3]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'sakila'
)

In [4]:
mycursor = mydb.cursor()
def sql_df(yq):
    mycursor.execute(yq)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult,columns= mycursor.column_names)
    return df

In [5]:
# Cek table yang ada pada database sakila
sql_df('show tables')

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [10]:
# Menampilkan isi table dari film_list
sql_df('select * from film_list limit 5')

,FID,title,description,category,price,length,rating,actors
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"WARREN NOLTE, OPRAH KILMER, ROCK DUKAKIS, MENA..."
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"CHRIS DEPP, SEAN GUINESS, MINNIE ZELLWEGER, BO..."
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"BOB FAWCETT, CAMERON STREEP, NICK WAHLBERG, RA..."
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"OPRAH KILMER, FAY WINSLET, KENNETH PESCI, JODI..."
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"GARY PHOENIX, DUSTIN TAUTOU, MATTHEW LEIGH, MA..."

1. Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan
urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [13]:
sql_df('select title, category, length from film_list where category = "Comedy" order by length limit 10')

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1    HEAVEN FREEDOM   Comedy      48
2  PARADISE SABRINA   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4         ZORRO ARK   Comedy      50
5        LION UNCUT   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa
DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang
diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [17]:
sql_df('select category as kategori, count(title) as jumlahMovie, avg(price) as rataHargaSewa from film_list group by category order by jumlahMovie desc')

       kategori  jumlahMovie rataHargaSewa
0       Foreign           73      3.099589
1        Sports           73      3.099589
2        Family           69      2.758116
3   Documentary           68      2.666471
4     Animation           66      2.808182
5        Action           64      2.646250
6           New           63      3.116984
7        Sci-Fi           61      3.219508
8         Drama           61      2.990000
9         Games           61      3.252295
10     Children           60      2.890000
11       Comedy           58      3.162414
12     Classics           57      2.744386
13       Horror           56      3.025714
14       Travel           56      3.275714
15        Music           51      2.950784

In [23]:
# Menampilkan isi dari table film_actor
sql_df('select * from film_actor limit 5')

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03

In [24]:
# Menampilkan isi dari table actor
sql_df('select * from actor limit 5')

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id_aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak.

In [28]:
sql_df('select F.actor_id, first_name, last_name, count(film_id) as jumlah_movie from actor A inner join film_actor F on A.actor_id = F.actor_id group by F.actor_id order by jumlah_movie desc limit 10')

   actor_id first_name  last_name  jumlah_movie
0       107       GINA  DEGENERES            42
1       102     WALTER       TORN            41
2       198       MARY     KEITEL            40
3       181    MATTHEW     CARREY            39
4        23     SANDRA     KILMER            37
5        81   SCARLETT      DAMON            36
6        37        VAL     BOLGER            35
7       158     VIVIEN   BASINGER            35
8       106    GROUCHO      DUNST            35
9        13        UMA       WOOD            35

4. Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi
film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk
mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh
Gina Degeneres.

In [33]:
sql_df('select category, count(title) as jumlah_movie from film_list L inner join film_actor A on L.FID = A.film_id where actor_id = "107" group by category')

       category  jumlah_movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

5. Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre
sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi
oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya.

In [35]:
sql_df('select title, category from film_list L inner join film_actor A on L.FID = A.film_id where actor_id = "107" and category = "Sci-Fi"')

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi